tutorials/Gyroscopic_motion_trial/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mover
{
    type            motionSolver;

    libs            ("libfvMotionSolvers.so" "libsolidBodyMotionFunctions.so");

    motionSolver    solidBody;

    select          all;

    solidBodyMotionFunction gyroscopicMotion;

    gyroscopicMotionCoeffs
    {
        origin  (0 0 0);         		
        globalAxis    (1 0 0);          
        localAxis		(0 0 1);		
        // Constant angular velocities
        globalOmega
        {
            type        constant;    			// all the Function1 entries can be used to define both local and global angular velocity 
			omega		5;
        }

        localOmega
        {
            type        constant;    
            omega		60;    
        }
    }

}


// ************************************************************************* //
